---
kind: property
id: P:Autodesk.Revit.DB.Structure.Truss.Curves
zh: 桁架
source: html/1cc0d1e3-a946-f2bd-56ca-fcd407dc552c.htm
---
# Autodesk.Revit.DB.Structure.Truss.Curves Property

**中文**: 桁架

Get all the truss curves.

## Syntax (C#)
```csharp
public CurveArray Curves { get; }
```

## Returns
The Curves property returns a CurveArray
that contains all the truss curves.